burakenez/gd32f50x-cmake-vscode/Examples/TIMER/TIMER16_pwmout_independtsignals/Application/Core/Src/main.c
/*!
    \file    main.c
    \brief   TIMER16 pwmout independent signals demo for GD32F50x

    \version 2026-02-25, V1.0.4, firmware for GD32F50x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32f50x.h"
#include <stdio.h>
#include "gd32f503v_eval.h"

/* configure the GPIO ports */
void gpio_config(void);
/* configure the TIMER peripheral */
void timer_config(void);

/*!
    \brief      configure the GPIO ports
    \param[in]  none
    \param[out] none
    \retval     none
*/
void gpio_config(void)
{
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_GPIOB);

    /*configure PA2/PA1(TIMER16 CH0/MCH0) as alternate function*/
    gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_2 | GPIO_PIN_1);
    gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_LEVEL2, GPIO_PIN_2 | GPIO_PIN_1);
    gpio_af_set(GPIOA, GPIO_AF_2, GPIO_PIN_2 | GPIO_PIN_1);

    /*configure PA3(TIMER16 CH1) as alternate function*/
    gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_3);
    gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_LEVEL2, GPIO_PIN_3);
    gpio_af_set(GPIOA, GPIO_AF_2, GPIO_PIN_3);

}

/*!
    \brief      configure the TIMER peripheral
    \param[in]  none
    \param[out] none
    \retval     none
*/
void timer_config(void)
{
    /* -----------------------------------------------------------------------
    TIMER16 configuration to:
    generate 2 pair PWM signals with 3 different duty cycles:
    - TIMER16 frequency is fixed to 252MHz, the TIMER16 prescaler is equal to 12600,
      so the TIMER16 counter frequency used is 20KHz. The PWM frequency is 2Hz.
    - TIMER16_MCH0 is independent of TIMER16_CH0.
    - the four duty cycles are computed as the following description:
       the channel 0 duty cycle is set to 20%.
       the multi mode channel 0 duty cycle is set to 60%.
       the channel 1 duty cycle is set to 40%.
      ----------------------------------------------------------------------- */
    timer_oc_parameter_struct timer_ocintpara;
    timer_parameter_struct timer_initpara;
    timer_omc_parameter_struct timer_omcpara;

    rcu_periph_clock_enable(RCU_TIMER16);

    timer_deinit(TIMER16);
    /* TIMER16 configuration */
    timer_struct_para_init(&timer_initpara);
    timer_initpara.prescaler         = 12600-1;
    timer_initpara.alignedmode       = TIMER_COUNTER_EDGE;
    timer_initpara.counterdirection  = TIMER_COUNTER_UP;
    timer_initpara.period            = 9999;
    timer_initpara.clockdivision     = TIMER_CKDIV_DIV1;
    timer_initpara.repetitioncounter = 0;
    timer_init(TIMER16, &timer_initpara);

    /* CH0/CH1 configuration in PWM mode 0 */
    timer_channel_output_struct_para_init(&timer_ocintpara);
    timer_ocintpara.outputstate  = TIMER_CCX_ENABLE;
    timer_ocintpara.outputnstate = TIMER_CCXN_ENABLE;
    timer_ocintpara.ocpolarity   = TIMER_OC_POLARITY_HIGH;
    timer_ocintpara.ocnpolarity  = TIMER_OCN_POLARITY_HIGH;
    timer_ocintpara.ocidlestate  = TIMER_OC_IDLE_STATE_LOW;
    timer_ocintpara.ocnidlestate = TIMER_OCN_IDLE_STATE_LOW;
    timer_channel_output_config(TIMER16, TIMER_CH_0, &timer_ocintpara);
    timer_channel_output_config(TIMER16, TIMER_CH_1, &timer_ocintpara);

    /* CH0 configuration in PWM mode 0 */
    timer_channel_output_pulse_value_config(TIMER16, TIMER_CH_0, 2000);
    timer_channel_output_mode_config(TIMER16, TIMER_CH_0, TIMER_OC_MODE_PWM0);
    timer_channel_output_shadow_config(TIMER16, TIMER_CH_0, TIMER_OC_SHADOW_DISABLE);
    /* CH1 configuration in PWM mode 0 */
    timer_channel_output_pulse_value_config(TIMER16, TIMER_CH_1, 4000);
    timer_channel_output_mode_config(TIMER16, TIMER_CH_1, TIMER_OC_MODE_PWM0);
    timer_channel_output_shadow_config(TIMER16, TIMER_CH_1, TIMER_OC_SHADOW_DISABLE);

    /* MCH0/MCH1 configuration in independently mode */
    timer_multi_mode_channel_output_parameter_struct_init(&timer_omcpara);
    timer_omcpara.outputmode   = TIMER_MCH_MODE_INDEPENDENTLY;
    timer_omcpara.outputstate  = TIMER_MCCX_ENABLE;
    timer_omcpara.ocpolarity   = TIMER_OMC_POLARITY_HIGH;
    timer_multi_mode_channel_output_config(TIMER16, TIMER_MCH_0, &timer_omcpara);
    /* MCH0 configuration in PWM mode 0 */
    timer_channel_output_pulse_value_config(TIMER16, TIMER_MCH_0, 6000);
    timer_channel_output_mode_config(TIMER16, TIMER_MCH_0, TIMER_OC_MODE_PWM0);
    timer_channel_output_shadow_config(TIMER16, TIMER_MCH_0, TIMER_OMC_SHADOW_DISABLE);

    /* auto-reload preload enable */
    timer_auto_reload_shadow_enable(TIMER16);
    timer_primary_output_config(TIMER16, ENABLE);
    timer_enable(TIMER16);
}

/*!
    \brief      main function
    \param[in]  none
    \param[out] none
    \retval     none
*/
int main(void)
{
    /* configure the GPIO ports */
    gpio_config();
    /* configure the TIMER peripheral */
    timer_config();

    while(1);
}